/*
	주석문,자료형,변수
*/
//전처리문
#include<stdio.h>

//메인 함수
void main() 
{
	/*
		1. 주석문
		코드 설명이나 기타 특이사항등을 주석을 달아줄때 사용한다.
	*/
	//한줄주석
	/*
		여러줄
		주석
	*/

	/*
		2. 선언부와 구현부
		C프로그램의 구조는 기본적으로 '선언부' 와 '구현부'로 나뉘어 지고, 그에 맞춰서 프로그래밍을 한다.
		'선언부'는 뒤에 나올 '구현부'에서 사용할 여러가지를 선언하는 내용을 담는다.
		
		ex)
		void main()
		{
			//선언부

			//구현부
			printf("Hello World");
		}

		중괄호 안의 윗부분에는 '선언부'가 먼저 와여 하며 그이후 '구현부'를 구현

		ex)
		{
			//선언부

			//구현부
			{
				//선언부

				//구현부
				{
					...
				}
			}
		}
	*/

	/*
		3. 자료형

		데이터를 표현하는 여러 자료형이 존재 자바와 동일

	*/
}